mnakai3/Arduino_Core_STM32/variants/WIO_LTE/PeripheralPins.c
//*** PWM ***

#ifdef HAL_TIM_MODULE_ENABLED
const PinMap PinMap_PWM[] = {
//  { PA_0 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 1, 0) },
//  { PA_0 , TIM5 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5 , 1, 0) },
    { PA_1 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 2, 0) },
//  { PA_1 , TIM5 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5 , 2, 0) },
//  { PA_2 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 3, 0) },
    { PA_2 , TIM5 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5 , 3, 0) },
//  { PA_2 , TIM9 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM9 , 1, 0) },
//  { PA_3 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 4, 0) },
    { PA_3 , TIM5 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM5 , 4, 0) },
//  { PA_3 , TIM9 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM9 , 2, 0) },
//  { PA_5 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 1, 0) },
//  { PA_5 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 1, 1) },
//  { PA_6 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 1, 0) },
//  { PA_6 , TIM13, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF9_TIM13, 1, 0) },
//  { PA_7 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 1, 1) },
//  { PA_7 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 2, 0) },
//  { PA_7 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 1, 1) },
//  { PA_7 , TIM14, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF9_TIM14, 1, 0) },
    { PA_8 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 1, 0) },
//  { PA_9 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 2, 0) },
//  { PA_10, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 3, 0) },
//  { PA_11, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 4, 0) },
    { PA_15, TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 1, 0) },
//  { PB_0 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 2, 1) },
    { PB_0 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 3, 0) },
//  { PB_0 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 2, 1) },
//  { PB_1 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 3, 1) },
    { PB_1 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 4, 0) },
//  { PB_1 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 3, 1) },
//  { PB_3 , TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 2, 0) },
    { PB_4 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 1, 0) },
    { PB_5 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 2, 0) },
//  { PB_6 , TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 1, 0) },
    { PB_7 , TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 2, 0) },
    { PB_8 , TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 3, 0) },
//  { PB_8 , TIM10, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM10, 1, 0) },
//  { PB_9 , TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 4, 0) },
//  { PB_9 , TIM11, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM11, 1, 0) },
//  { PB_10, TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 3, 0) },
    { PB_11, TIM2 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2 , 4, 0) },
    { PB_13, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 1, 1) },
//  { PB_14, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 2, 1) },
    { PB_14, TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 2, 1) },
//  { PB_14, TIM12, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF9_TIM12, 1, 0) },
//  { PB_15, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 3, 1) },
    { PB_15, TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 3, 1) },
//  { PB_15, TIM12, STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF9_TIM12, 2, 0) },
    { PC_6 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 1, 0) },
//  { PC_6 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 1, 0) },
//  { PC_7 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 2, 0) },
//  { PC_7 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 2, 0) },
//  { PC_8 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 3, 0) },
    { PC_8 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 3, 0) },
//  { PC_9 , TIM3 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3 , 4, 0) },
    { PC_9 , TIM8 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM8 , 4, 0) },
    { PD_12, TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 1, 0) },
    { PD_13, TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 2, 0) },
    { PD_14, TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 3, 0) },
    { PD_15, TIM4 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4 , 4, 0) },
    { PE_5 , TIM9 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM9 , 1, 0) },
    { PE_6 , TIM9 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM9 , 2, 0) },
    { PE_8 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 1, 1) },
    { PE_9 , TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 1, 0) },
    { PE_10, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 2, 1) },
    { PE_11, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 2, 0) },
    { PE_12, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 3, 1) },
    { PE_13, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 3, 0) },
    { PE_14, TIM1 , STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1 , 4, 0) },
    { NC   , NP   , 0                                                                   }
};
#endif

//*** SERIAL ***

